import React from 'react';

const RulesPage = () => {
    return (
        <div>
            <main>
                <h1>Правила Dating Auction</h1>

                <section>
                    <h2>Про захід</h2>
                    <p>
                        Так-так, вам не почулося! Подія, про яку всі говорили, на яку так довго чекали,
                        нарешті тут! FiDo запускає наймасштабніший Аукціон Побачень. Наша мета — не просто
                        влаштувати круту подію, а зібрати максимальну суму для ЗСУ! Кожна ставка — це твій
                        внесок у перемогу!
                    </p>
                </section>

                <section>
                    <h2>Як користуватися сайтом</h2>
                    <ul>
                        <li>Завантажуєш фотографію чарівного себе та коротенький опис своєї персони</li>
                        <li>Моніториш сайт у пошуках тієї людини, заради якої готовий відірвати від серця частину своїх заощаджень</li>
                        <li>Робиш ставку</li>
                    </ul>
                </section>

                <section>
                    <h2>Правила ставок</h2>
                    <ul>
                        <li>Мінімальна ставка - 10 грн</li>
                        <li>Мінімальне підвищення ставки - 10 грн</li>
                        <li>Оффлайн-аукціон - 1000 грн</li>
                        <li>Автоматичний викуп лоту (максимальна ставка) - 10000 грн</li>
                    </ul>
                    <p>
                        <strong>Увага!</strong> Лоти, які наберуть 1000 грн, буде розіграно на офлайн-аукціоні.
                    </p>
                </section>

                <section>
                    <h2>Реєстрація та участь</h2>
                    <ul>
                        <li>Для участі необхідно авторизуватися через Microsoft Office 365</li>
                        <li>Кожен учасник може створити лише один лот</li>
                        <li>Всі дані в профілі мають бути достовірними</li>
                        <li>Фотографії мають відповідати правилам пристойності</li>
                    </ul>
                </section>

                <section>
                    <h2>Після аукціону</h2>
                    <p>
                        Місце, час і формат зустрічі - справа безпосередньо учасників заходу. Побачення є
                        обов'язковим, однак не накладає на лот/покупця жодних додаткових зобов'язань
                        (у випадку відчуття небезпеки – сповістіть це організаторів).
                    </p>
                    <p>
                        Команда FiDo несе відповідальність лише за організацію й проведення аукціону.
                        Ми не маємо ніякого стосунку до всіх тих незабутніх (або не дуже) хвилинок,
                        які чекатимуть на вас на побаченні.
                    </p>
                </section>

                <section>
                    <h2>Заборонено</h2>
                    <p>Не порушуйте правил аукціону. Учасникам заходу заборонено:</p>
                    <ul>
                        <li>Видаляти лот</li>
                        <li>Видаляти ставки з коментарів</li>
                        <li>Неоплата вашої ставки</li>
                        <li>Домагання, образи та неприйнятний контент</li>
                        <li>Поширювати особисту інформацію інших учасників без їхньої згоди</li>
                    </ul>
                    <p>
                        <strong>(!) Порушення є підставою для заборони брати участь в аукціоні.</strong>
                    </p>
                    <p>Використовуйте функцію скарг для повідомлення про порушення.</p>
                </section>

                <section>
                    <h2>Поведінка учасників</h2>
                    <ul>
                        <li>Поважайте інших учасників</li>
                        <li>Дотримуйтесь правил пристойності</li>
                        <li>Будьте чесними та відповідальними</li>
                    </ul>
                </section>

                <section>
                    <h2>Конфіденційність</h2>
                    <ul>
                        <li>Ваші особисті дані захищені</li>
                        <li>Контактна інформація переможця буде надана власнику лоту</li>
                        <li>Не поширюйте особисту інформацію інших учасників без їхньої згоди</li>
                    </ul>
                </section>

                <section>
                    <h2>Контакти</h2>
                    <p>
                        Якщо у вас є питання або проблеми, зверніться до організаторів через форму
                        зворотнього зв'язку.
                    </p>
                    <p>
                        Нагадуємо, що захід організовано на благодійних засадах.
                    </p>
                    <p>
                        <strong>FiDo бажає тобі гарних покупок!</strong>
                    </p>
                </section>
            </main>
        </div>
    );
};

export default RulesPage;